Repository: miurahr/aqtinstall-docs-omegat-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: (Optional) The tool variant name.
ja: (オプション)ツールのバリアント名。

source: (default: 5 sec)
ja: (デフォルト:5秒)

source: **Archives**: In this context, an **archive** is a bundle of files compressed with the 7zip algorithm.
ja: **Archives**: このコンテキストでは、**Archive** は 7-zipで圧縮されたファイルのバンドルです。

source: **Modules**: The Qt repository organizes groups of archives into modules.
ja: **Modules**: Qtリポジトリが一連のアーカイブをモジュールとして編成しています。

source: **the base Qt installation**: By definition, this is just another **module** that contains 20-30 **archives**.
ja: **the base Qt installation**: 定義上、これは20から30の**archives** を含む単なる **module** です。

source: A **module** contains one or more **archives**.
ja: **module** には、ひとつか複数の **archives** が含まれます。

source: A default configuration is stored in ``aqt/settings.ini`` file.
ja: デフォルトの設定は ``aqt/settings.ini`` ファイルに保存されています。

source: A file is like as follows:
ja: 設定ファイルは次のようになります。

source: Activity: moderate
ja: 活動度:中等度

source: All contributors, listed alphabetically, are:
ja: すべてのコントリビュータ(アルファベット順)は次のとおりです。

source: All downloaded archives will be automatically deleted unless you have specified the ``--keep`` option above, or ``aqt`` crashes.
ja: 上記の ``--keep`` オプションが指定されていないか、または ``aqt`` がクラッシュしない限り、ダウンロードしたアーカイブはすべて自動的に削除されます。

source: All notable changes to this project will be documented in this file.
ja: このプロジェクトに対するすべての注目すべき変更は、このファイルに文書化されます。

source: An example of this output is displayed below.
ja: この出力例を以下に示します。

source: Any following arguments must be the names of modules available for the preceding version and architecture.
ja: 後続の引数は、以前のバージョンとアーキテクチャーで使用できるモジュールの名前である必要があります。

source: Aqtinstall is written and maintained by Hiroshi Miura <miurahr@linux.com>
ja: Aqtinstallは、三浦広志 <miurahr@linux.com> 氏により作成され、管理されています。

source: Arguments are changed
ja: 引数が変更されました

source: As a result, the command printed a list of archives that are part of the base (non-minimal) Qt installation.
ja: その結果、コマンドはベース(最小ではない)Qtインストールの一部であるアーカイブのリストを出力しました。

source: As of aqt v2.1.0, the ``--archives`` flag will only apply to the base Qt installation and to the ``debug_info`` module. Previous versions of aqt required that when installing modules with the ``--archives`` flag, the user must specify archives for each module, otherwise they would not be installed. This behavior has been changed to prevent such mistakes.
ja: aqt v2.1.0以降では、``--archives``フラグはQtの基本インストールと``debug_info``モジュールにのみ適用されます。aqtの以前のバージョンでは、``--archives``フラグを付けてモジュールをインストールする場合、ユーザはモジュールごとにアーカイブを指定する必要がありました。指定しないとインストールされませんでした。このようなミスを防止するために、この動作を変更しました。

source: At present, ``aqt install-qt`` is incapable of installing any archive from the ``debug_info`` module without also installing the corresponding module from the base Qt installation.
ja: 現在、``aqt install-qt``は、基本Qtインストールから対応するモジュールをインストールせずに、``debug_info`` モジュールからアーカイブをインストールすることはできません。

source: Authors
ja: 作者

source: Be careful about using the ``--archives`` flag; it is marked `Advanced` for a reason! It is very easy to misuse this command and end up with a Qt installation that is missing the components that you need. Don't use it unless you know what you are doing!
ja: ``--archives`` フラグの使用には注意してください。`Advanced` とマークされているのは理由があります! このコマンドを誤用しますと、必須コンポーネントがない不完全なQtインストール結果になります。自分が何をしているのかわかっていない限り、使用しないでください!

source: Because the :ref:`aqt list-qt <list-qt command>` command directly queries the Qt downloads repository at https://download.qt.io/, the results of this command will always be accurate.
ja: :ref:`aqt list-qt <list-qt command>` コマンドは https://download.qt.io/ にあるQtダウンロードリポジトリに直接問い合わせますので、このコマンドの結果は常に正確になります。

source: Before running ``aqt``, you will need to tell ``aqt`` exactly what you want it to install.
ja: ``aqt`` を実行する前に、何をインストールしたいのかを正確に ``aqt`` に指示する必要があります。

source: Bug Tracker: Github issue `Tracker`_
ja: バグトラッカー: Github issue `Tracker`_

source: Bug triage
ja: バグ・トリアージ

source: By default, ``aqt`` extracts the 7zip archives stored in the Qt repository using py7zr_, which is installed alongside ``aqt``.
ja: デフォルトでは、``aqt`` はQtリポジトリに保存されている 7-zipアーカイブを、 ``aqt`` と一緒にインストールされている py7zr_ を使って抽出します。

source: By default, ``aqt`` will install all of the Qt packages into the current working directory, in the subdirectory ``./<Qt version>/<arch>/``.
ja: デフォルトでは、``aqt`` はすべてのQtパッケージを現在の作業ディレクトリのサブディレクトリ ``./<Qt version>/<arch>/`` にインストールします。

source: By default, ``list-doc`` will print a list of archives available for installation using the `install-doc command`_, with the ``--archives`` option.
ja: デフォルトでは、 ``list-doc`` は `install-docコマンド`_ と ``--archives`` オプションを使ってインストール可能なアーカイブのリストを出力します。

source: By default, ``list-example`` will print a list of archives available for installation using the `install-example command`_, with the ``--archives`` option.
ja: デフォルトでは、 ``list-example`` は `install-example command`_ と ``--archives`` オプションを使ってインストール可能なアーカイブのリストを出力します。

source: By default, aqt installs to the current working directory.
ja: デフォルトでは、aqtは現在の作業ディレクトリにインストールされます。

source: By default, aqt uses py7zr_ for this task.
ja: デフォルトでは、aqtはこのタスクに py7zr_ を使用します。

source: CI tests
ja: CIテスト

source: Caution with last (s)
ja: 最後の引数に注意

source: Changing the output directory
ja: 出力ディレクトリの変更

source: Command Line Options
ja: コマンドラインオプション

source: Command changes
ja: コマンドの変更

source: Command examples
ja: コマンドの例

source: Common Options
ja: 共通オプション

source: Configuration
ja: 構成

source: Contribution guide
ja: コントリビューションガイド

source: Dependent libraries: requests, py7zr, semantic_version, patch, texttable, bs4
ja: 依存ライブラリ:requests,py7zr,semantic_version,patch,texttable,bs4

source: Deprecated and marked for removal in a future version of aqt.
ja: 将来のバージョンのaqtでは廃止され、削除される予定です。

source: Deprecated; please do not use this setting.
ja: 廃止されました。

source: Display help text
ja: ヘルプテキストを表示する

source: Documentation for these older commands is still available at https://aqtinstall.readthedocs.io/en/v1.2.4/
ja: これらの古いコマンドのドキュメントは、https://aqtinstall.readthedocs.io/en/v1.2.4/でまだ入手できます。

source: Every report to github issue tracker should be in triage. whether it is bug, question or invalid.
ja: github issue trackerへのすべてのレポートは、バグであれ、質問であれ、無効であれ、トリアージする必要があります。

source: Example: Install MinGW on Windows
ja: 例:WindowsへのMinGWのインストール

source: Example: Install Web Assembly
ja: 例: Webアセンブリのインストール

source: Example: Install an Install FrameWork (IFW):
ja: 例:Install FrameWork(IFW)のインストール:

source: Example: Install examples, doc and source:
ja: 例: example、docおよびsourceのインストール:

source: Example: Install vcredist on Windows:
ja: 例:Windowsへのvcredistのインストール:

source: Example: Installing Android (armv7) Qt 5.13.2:
ja: 例:Android(armv7)Qt 5.13.2のインストール:

source: Example: Installing Qt SDK 5.12.12 for Linux with QtCharts and QtNetworkAuth:
ja: 例:QtChartsとQtNetworkAuthでQt SDK 5.12.12 for Linuxをインストールする:

source: Example: Installing the newest LTS version of Qt 5.12:
ja: 例:Qt 5.12の最新のLTSバージョンをインストールする

source: Example: List available architectures for Qt 6.1.2 on windows
ja: 例:Windows上のQt 6.1.2で利用可能なアーキテクチャを一覧表示する

source: Example: List available modules for latest version of Qt on macOS
ja: 例:macOS上のQtの最新バージョンで利用可能なモジュールを一覧表示する

source: Example: List available tools on windows
ja: 例: WIndowsで使用可能なツールを一覧表示する

source: Example: List available versions of Qt on Linux
ja: 例: Linuxで利用可能なQtのバージョンを一覧表示する

source: Example: List available versions of Qt6 on macOS
ja: 例:macOS上で利用可能なQt6のバージョンを一覧表示する

source: Example: List the variants of IFW available:
ja: 例:使用可能なIFWのバリエーションを一覧表示する。

source: Example: List the variants of IFW, including version, release date, description, etc.:
ja: 例:バージョン、リリース日、説明など、IFWのバリエーションを一覧表示する。

source: Example: Print archives available for installation with ``install-example/doc/src``:
ja: 例: ``install-example/doc/src`` でインストール可能なアーカイブを一覧表示します。

source: Example: Print modules available for installation with ``install-example/doc``:
ja: 例: ``install-example/doc`` でインストール可能なモジュールを一覧表示します:

source: Example: Show help message
ja: 例:ヘルプメッセージの表示

source: Extension of packages to list {wasm,src_doc_examples,preview,wasm_preview,x86_64,x86,armv7,arm64_v8a}
ja: リスト表示するパッケージ拡張{wasm,src_doc_examples,preview,wasm_preview,x86_64,x86,armv7,arm64_v8a}

source: External 7-zip extractor
ja: 7-Zip 解凍 外部 コマンド

source: Finally, let's install Qt 6.2.0 for Android armv7 with the ``qtcharts`` and ``qtnetworkauth`` modules:
ja: 最後に、``qtcharts`` と ``qtnetworkauth`` モジュールとともに、Qt 6.2.0 for Android armv7をインストールしましょう。

source: For example, ``aqt install-doc mac 5.12`` would install documentation for the newest version of Qt 5.12 available, and ``aqt install-doc mac "*"`` would install documentation for the highest version of Qt available.
ja: 例えば、``aqt install-doc mac 5.12`` と指定するとQt 5.12の最新バージョンのドキュメントがインストールされ、``aqt install-doc mac "*"`` と指定するとQtの最新バージョンのドキュメントがインストールされます。

source: For example, ``aqt install-example mac 5.12`` would install examples for the newest version of Qt 5.12 available, and ``aqt install-example mac "*"`` would install examples for the highest version of Qt available.
ja: 例えば、``aqt install-example mac 5.12``はQt 5.12の最新バージョンのサンプルをインストールし、``aqt install-example mac "*"``はQtの最新バージョンのサンプルをインストールします。

source: For example, ``aqt install-qt mac desktop 5.12`` would install the newest version of Qt 5.12 available, and ``aqt install-qt mac desktop "*"`` would install the highest version of Qt available.
ja: 例えば、``aqt install-qt mac desktop 5.12`` はQt 5.12の最新バージョンをインストールし、``aqt install-qt mac desktop "*"`` はQtの最新バージョンをインストールします。

source: For example, ``aqt install-src mac 5.12`` would install sources for the newest version of Qt 5.12 available, and ``aqt install-src mac "*"`` would install sources for the highest version of Qt available.
ja: 例えば、``aqt install-src mac 5.12`` は入手可能な最新バージョンのQt 5.12のソースをインストールし、``aqt install-src mac "*"`` は入手可能な最新バージョンのQtのソースをインストールします。

source: For example, ``aqt list-doc mac 5.12`` would print archives for the latest version of Qt 5.12 available (5.12.11 at the time of this writing).
ja: 例えば、``aqt list-doc mac 5.12`` は入手可能な最新バージョンのQt 5.12(この記事を書いている時点では5.12.11)のアーカイブを出力します。

source: For example, ``aqt list-example mac 5.12`` would print archives for the latest version of Qt 5.12 available (5.12.11 at the time of this writing).
ja: 例えば、 ``aqt list-example mac 5.12`` は入手可能な最新バージョンのQt 5.12(この記事を書いている時点では5.12.11)のアーカイブを出力します。

source: For example, ``aqt list-qt windows desktop --spec "5.12"`` would print all versions of Qt for Windows Desktop beginning with 5.12.
ja: 例えば、``aqt list-qt windows desktop --spec "5.12"`` と入力すると、5.12から始まるWindows デスクトップ用のQtのすべてのバージョンが出力されます。

source: For example, ``aqt list-src mac 5.12`` would print archives for the latest version of Qt 5.12 available (5.12.11 at the time of this writing).
ja: 例えば、``aqt list-src mac 5.12``は入手可能な最新バージョンのQt 5.12(この記事を書いている時点では5.12.11)のアーカイブを出力します。

source: For example, if we install Qt 6.2.0 for Windows desktop with arch `win64_mingw81`, it would end up in ``./6.2.0/win64_mingw81``.
ja: 例えば、Qt 6.2.0 for Windows desktopをarch `win64_mingw81` でインストールすると、その結果は ``./6.2.0/win64_mingw81`` になります。

source: For example, you could use 7-zip_ on a Windows desktop, using this command:
ja: 例えば、Windowsデスクトップで次のコマンドを使って 7-zip_ を使うことができます。

source: For instance, you cannot install the ``debug_info`` archive for ``qtbase`` without also installing the usual ``qtbase`` archive.
ja: 例えば、通常の``qtbase``アーカイブをインストールせずに、``qtbase``用の``debug_info`` アーカイブをインストールすることはできません。

source: From version 2.0.0, sub commands are changed.
ja: バージョン2.0.0から、サブコマンドが変更されました。

source: General usage of ``aqt`` looks like this:
ja: ``aqt``の一般的な使い方は以下のようになります:

source: Generic commands
ja: 一般的なコマンド

source: Getting Started
ja: スタートアップガイド

source: Here is small amount rule when you want to send patch the project;
ja: プロジェクトにパッチを送りたい場合の少量のルールを以下に示します。

source: Here, we have used the ``--archives`` flag with two arguments: the version of Qt we are interested in, and the architecture we are using.
ja: ここでは、関心のあるQtのバージョンと使用しているアーキテクチャの2つの引数を持つ``--archives``フラグを使用しました。

source: I know, it sounds a little backwards, but that's how the Qt repo was put together.
ja: 少し機能後退したように聞こえますが、それがQtリポジトリが組み立てられた方法です。

source: If the name of **the base Qt installation** were transformed using the same rules, the name would be empty.
ja: **the base Qt installation** の名前を同じ規則を使って変換された場合、名前は空になります。

source: If we need to use some architecture that is not on this list, we can use the `Available Qt versions`_ wiki page to get a rough idea of what versions support the architecture we want, and then use :ref:`aqt list-qt <list-qt command>` to confirm that the architecture is available.
ja: このリストにないアーキテクチャを使用する必要がある場合は、`Available Qt versions`_ wikiページを使用して、どのバージョンが希望するアーキテクチャをサポートしているかの大まかなアイデアを得てから、 :ref:`aqt list-qt <list-qt command>` を使用して、アーキテクチャが使用可能であることを確認します。

source: If we tried this command with `android`, `winrt`, or `ios` targets, we would have seen an error message.
ja: このコマンドを`android`、`winrt`、`ios`ターゲットで実行すると、エラーメッセージが表示されます。

source: If we want to install Qt 6.2.0 for armv7, we use this command to print available modules:
ja: armv7用のQt 6.2.0をインストールしたい場合は、次のコマンドを使って利用可能なモジュールを出力します。

source: If we wish to install all the modules that are available, we can do that with the ``all`` keyword:
ja: 利用可能なすべてのモジュールをインストールしたい場合は、``all`` キーワードでインストールできます。

source: If you add a list of modules to this flag, this command will print a list of all the archives that make up the specified modules.
ja: このフラグにモジュールのリストを追加すると、指定されたモジュールを構成するすべてのアーカイブのリストが出力されます。

source: If you are installing an ios or android version of Qt, the corresponding desktop version of Qt must be installed alongside of it.
ja: iosまたはandroidバージョンのQtをインストールする場合は、対応するデスクトップバージョンのQtも一緒にインストールする必要があります。

source: If you do not add a list of modules to this flag, this command will print a list of all the archives that make up the base Qt installation.
ja: このフラグにモジュールのリストを追加しない場合、このコマンドは基本Qtインストールを構成するすべてのアーカイブのリストを出力します。

source: If you do not specify a download destination, aqt will place these files in the current working directory.
ja: ダウンロード先を指定しない場合、aqtはこれらのファイルを現在の作業ディレクトリに配置します。

source: If you find a missing name to record, please feel free to tell me.
ja: 記録に名前がない方は、遠慮なく言ってください。

source: If you have installed ``aqt`` with pip, you can run it with the command script ``aqt``, but in some cases you may need to run it as ``python -m aqt``.
ja: pipと一緒に``aqt``をインストールしている場合は、コマンドスクリプト``aqt``で実行することができますが、場合によっては``python-m aqt``として実行する必要があるかもしれません。

source: If you installed the module ``debug_info``, it may have installed more than 1 gigabyte of data.
ja: モジュール ``debug_info`` をインストールした場合、1 GB以上のデータがインストールされている可能性があります。

source: If you need those changes to occur, it will be your responsibility to make those changes happen, because ``aqt`` is not capable of running this script.
ja: これらの変更が必要な場合、``aqt`` はこのスクリプトを実行することができないので、変更を加えるのはあなたの責任になります。

source: If you try this, you will notice that `debug_info` is 5.9 gigabytes installed.
ja: これを試してみると、``debug_info`` では、5.9ギガバイトがインストールされることに気付くでしょう。

source: If you type something in the ``<Qt version>`` positional argument that cannot be interpreted as a version, it will be interpreted as a `SimpleSpec`_, and ``aqt`` will select the highest available version within that `SimpleSpec`_.
ja: バージョンとして解釈できない何かを位置引数 ``<Qt version>`` に入力すると、それは `SimpleSpec`_ として解釈され、``aqt`` はその`SimpleSpec`_ 内で利用可能な最高バージョンを選択します。

source: If you want to install all available modules, you are probably better off using the ``all`` keyword, as discussed above. This scripting example is presented to give you a sense of how to accomplish something more complicated. Perhaps you want to install all modules except `qtnetworkauth`; you could write a script that removes `qtnetworkauth` from the output of :ref:`aqt list-qt <list-qt command>`, and pipe that into :ref:`aqt install-qt <qt installation command>`. This exercise is left to the reader.
ja: 利用可能なすべてのモジュールをインストールしたい場合は、上記のように ``all`` キーワードを使った方が良いでしょう。このスクリプトの例は、もっと複雑な何かを実現する方法を理解するために提示されています。おそらくあなたは ``qtnetworkauth`` 以外のすべてのモジュールをインストールしたいと思うでしょう。 :ref:`aqt list-qt <list-qt command>` の出力から ``qtnetworkauth`` を削除し、それを :ref:`aqt install -qt<qt installation command>` にパイプするスクリプトを書くことができます。この練習は読者にお任せします。

source: If you wish to install every module available, you may use the ``all`` keyword instead of a list of modules, like this:
ja: 利用可能なすべてのモジュールをインストールしたい場合は、次のように、モジュールのリストの代わりに ``all``キーワードを使うことができます。

source: If you would prefer to install it to another location, you will need to use the ``-O`` or ``--outputdir`` flag.
ja: 別の場所にインストールしたい場合は、``-O`` または ``--outputdir`` フラグを使う必要があります。

source: If your target is ios, please be aware that versions of Qt older than 6.2.4 are expected to be non-functional with current versions of XCode (applies to any XCode greater than or equal to 13).
ja: ターゲットがiosの場合、6.2.4よりも古いバージョンのQtは、現在のバージョンのXCodeでは機能しないことに注意してください(バージョン13以上のXCodeに適用されます)。

source: If your terminal is wider than 95 characters, ``aqt list-qt`` will also display release dates and sizes for each module.
ja: 端末の表示幅が95文字を超える場合、``aqt list-qt`` には各モジュールのリリース日とサイズも表示されます。

source: If your terminal is wider than 95 characters, ``aqt list-tool`` will also display the names and descriptions for each tool.
ja: あなたの端末の表示幅が95文字を超える場合、``aqt list-tool`` は各ツールの名前と説明も表示します。

source: In the past, our users have had success using 7-zip_ on Windows, Linux and Mac.
ja: これまで、ユーザは Windows、Linux、Macで 7-zip_ を使ってうまくやってきました。

source: In this documentation, **"modules"**, **"archives"**, and **"the base Qt installation"** refer to different things, and are defined here:
ja: このドキュメントでは、**"modules"**, **"archives"**, **"base Qt installation"** はそれぞれ別のものを指しており、ここで定義されています:

source: Incompatible with the ``--extension`` flag.
ja: `--extension`フラグとは互換性がありません。

source: Incompatible with the ``--extensions`` flag, but may be combined with any other flag.
ja: `--extensions``フラグとは互換性がありませんが、他のフラグと組み合わせることができます。

source: Install Qt documentation for the specified version and target.
ja: 指定されたバージョンとターゲットのQtドキュメントをインストールします。

source: Install Qt examples for the specified version and target.
ja: 指定されたバージョンとターゲットのQtサンプルをインストールします。

source: Install Qt library, with specified version and target.
ja: 指定されたバージョンとターゲットでQtライブラリをインストールします。

source: Install Qt source code for the specified version and target.
ja: 指定されたバージョンとターゲットのQtソースコードをインストールします。

source: Install by pip command
ja: pipコマンドによるインストール

source: Install command
ja: インストール・コマンド

source: Install tools like QtIFW, mingw, Cmake, Conan, and vcredist.
ja: QtIFW、mingw、Cmake、Conan、vcredistなどのツールをインストールします。

source: Install-* Commands
ja: Install-*コマンド

source: Installation
ja: インストール

source: Installing Modules
ja: モジュールのインストール

source: Installing Modules With Archives Specified
ja: アーカイブを指定してモジュールをインストールする

source: Installing More Than The Bare Minimum
ja: 最小インストール数を超えるインストール

source: Installing Qt
ja: Qtをインストールする

source: Installing Qt 5 will be similar to installing Qt for Desktop on Windows, but there will be differences when we get to Qt 6.
ja: Qt 5のインストールはWindows上のQt for Desktopのインストールと似ていますが、Qt 6では違いがあります。

source: Installing Qt for Android
ja: Android用Qtのインストール

source: Installing Qt for WASM
ja: WASM用Qtのインストール

source: Installing Tools
ja: ツールをインストールする

source: Installing a subset of Qt archives [Advanced]
ja: Qtアーカイブのサブセットをインストールする[上級編]

source: Installing the ``debug_info`` module
ja: ``debug_info``モジュールのインストール

source: Introduction
ja: はじめに

source: It can cause broken installation of Qt SDK.
ja: Qt SDKのインストールが失敗する可能性があります。

source: It exists on a disk drive as a file with the extension ``.7z``.
ja: これはディスクドライブ上に拡張子``.7z``"のファイルとして存在します。

source: It has been replaced by the
ja: この設定は使用しないでください。

source: It is a command name of 7-zip.
ja: 圧縮解凍ツールの7-zipのコマンド名です。

source: It is a list of URL where is a good for access.
ja: アクセスに適したURLの一覧です。

source: It is a list of URL where is a problematic mirror site.
ja: 問題のあるミラーサイトがあるURLのリストです。

source: It is as same as ``--base`` option.
ja: これは``--base``オプションと同じです。

source: It is only applied to Qt 5.15.2.
ja: これはQt 5.15.2にのみ適用されます。

source: It is passed to ``requests`` library.
ja: これは``requests``ライブラリに渡されます。

source: It may be required for vcredist and mingw installation.
ja: vcredistおよびmingwのインストールで必要になる場合があります。

source: It should be a integer value.
ja: これは整数値でなくてはなりません。

source: It will cause connection error or connection timeout.
ja: 接続エラーまたは接続タイムアウトが発生します。

source: It will only affect the base Qt installation and the ``debug_info`` module.
ja: これはQtの基本インストールと ``debug_info`` モジュールにのみ影響します。

source: Keep downloaded archive when specified, otherwise remove after install.
ja: 指定された場合はダウンロードされたアーカイブを保持します。指定されていない場合はインストール後に削除します。

source: Keep downloaded archive when specified, otherwise remove after install. Use ``--archive-dest <path>`` to choose where aqt will place these files. If you do not specify a download destination, aqt will place these files in the current working directory.
ja: 指定された場合はダウンロードされたアーカイブを保持します。指定されていない場合はインストール後に削除します。これらのファイルをaqtが配置する場所を選択するには、 ``--archive-dest <path>``を使用します。ダウンロード先を指定しない場合、aqtはこれらのファイルを現在の作業ディレクトリに配置します。

source: Keep in mind that Qt for IOS is only available on Mac OS, and Qt for WinRT is only available on Windows.
ja: Qt for IOSはMac OSでのみ利用可能であり、Qt for WinRTはWindowsでのみ利用可能であることに注意してください。

source: Legacy list commands are removed.
ja: 従来のリストコマンドは削除されました。

source: Legacy sub commands
ja: レガシーサブコマンド

source: Legacy subcommands
ja: 従来のサブコマンド

source: Let's find out what tools are available for Windows Desktop by using the :ref:`aqt list-tool <list-tool command>` command:
ja: :ref:`aqt list-tool <list-tool command>` コマンドを使って、Windows Desktopで利用できるツールを調べてみましょう。

source: Let's install Qt for Android.
ja: Qt for Androidをインストールしてみましょう。

source: Let's install Qt with ``qtcharts`` and ``debug_info`` with some archives specified:
ja: ``qtcharts``と``debug_info``つきでQtをインストールし、いくつかのアーカイブを指定しましょう。

source: Let's say that the ``qtbase`` archive is missing some features that you need.
ja: ``qtbase``アーカイブに必要な機能が欠けているとします。

source: Let's say that we need to install the bare minimum Qt 5.15.2, with the modules ``qtcharts`` and ``qtlottie``:
ja: モジュール``qtcharts``と``qtlottie``を使って、最低限のQt 5.15.2をインストールする必要があるとしましょう。

source: Let's say that we want to install Qt 5.15.2 for Linux desktop, using the gcc_64 architecture. The ``qtbase`` archive includes the bare minimum for a working Qt installation, and we can install it alone with the ``--archives`` flag:
ja: gcc_64アーキテクチャを使ってQt 5.15.2をLinuxデスクトップにインストールしたいとしましょう。``qtbase`` アーカイブには、動作中のQtインストールに最低限必要なものが含まれています。また、``--archives`` フラグを付けて単独でインストールすることもできます。

source: Let's say that we want to install Qt 6.2.0 with architecture `win64_mingw81`.
ja: Qt 6.2.0を `win64_mingw81` アーキテクチャでインストールしたいとします。

source: Let's say that we want to install `qtcharts` and `qtnetworkauth`.
ja: ``qtcharts``と ``qtnetworkauth`` をインストールしたいとします。

source: Let's say that we want to install the next version of Qt 6.2 as soon as it is available.
ja: Qt 6.2の次のバージョンが利用可能になったらすぐにインストールしたいとしましょう。

source: Let's say that we want to know more about these modules before we install them.
ja: これらのモジュールをインストールする前に、これらのモジュールについてもっと知りたいとしましょう。
